sroggerini/SCU_FW_Develop/Src/stm32f4xx_periph_init_MP28947.c
  /*Configure GPIO pins : EN_PM3uP_Pin RST_DEV_Pin SCS3PuP_Pin SPI2_CS_1_Pin
                           ETH_REF_CK_EN_Pin SCS1PuP_Pin */
  GPIO_InitStruct.Pin = EN_PM3uP_Pin|RST_DEV_Pin|SCS3PuP_Pin|SPI2_CS_1_Pin
                          |ETH_REF_CK_EN_Pin|SCS1PuP_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

  /*Configure GPIO pin : EN_PM1uP_Pin */
  GPIO_InitStruct.Pin = EN_PM1uP_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(EN_PM1uP_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : H_LED_Pin */
  GPIO_InitStruct.Pin = H_LED_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(H_LED_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : TA23TYPE_Pin */
  GPIO_InitStruct.Pin = TA23TYPE_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(TA23TYPE_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : TA1TYPE_Pin */
  GPIO_InitStruct.Pin = TA1TYPE_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(TA1TYPE_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : SYN3PuP_Pin SYN1PuP_Pin */
  GPIO_InitStruct.Pin = SYN3PuP_Pin|SYN1PuP_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /*Configure GPIO pins : RCDM_Pin SPI_485_Pin */
  GPIO_InitStruct.Pin = RCDM_Pin|SPI_485_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

  /*Configure GPIO pin : up_ZCR_Pin */
  GPIO_InitStruct.Pin = up_ZCR_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(up_ZCR_GPIO_Port, &GPIO_InitStruct);
  
  /*Configure GPIO pins : IN1_Pin DIODO_ADC_Pin SW_IN_ADC_Pin */
  GPIO_InitStruct.Pin = IN1_Pin|DIODO_ADC_Pin|SW_IN_ADC_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /*Configure GPIO pins : CNTCT_Pin RFID_PWR_Pin BOOT_EN_Pin WIFI_EN_Pin
                           ETH_RST_Pin RFID_DTC_Pin */
  GPIO_InitStruct.Pin = CNTCT_Pin|RFID_PWR_Pin|BOOT_EN_Pin|WIFI_EN_Pin
                          |ETH_RST_Pin|RFID_DTC_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /*Configure GPIO pins : WIFI_IO9_Pin SW_PROG_Pin */
  GPIO_InitStruct.Pin = WIFI_IO9_Pin|SW_PROG_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /*Configure GPIO pin : UART1_DE_Pin */
  GPIO_InitStruct.Pin = UART1_DE_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(UART1_DE_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : SPI1_NSS_Pin */
  GPIO_InitStruct.Pin = SPI1_NSS_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(SPI1_NSS_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : PRG_TX_Pin */
  GPIO_InitStruct.Pin = PRG_TX_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF8_UART5;
  HAL_GPIO_Init(PRG_TX_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : PRG_RX_Pin */
  GPIO_InitStruct.Pin = PRG_RX_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF8_UART5;
  HAL_GPIO_Init(PRG_RX_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : UART2_DE_Pin */
  GPIO_InitStruct.Pin = UART2_DE_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(UART2_DE_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : IN3_Pin */
  GPIO_InitStruct.Pin = IN3_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(IN3_GPIO_Port, &GPIO_InitStruct);

  /* USER CODE BEGIN MX_GPIO_Init_2 */
  /* USER CODE END MX_GPIO_Init_2 */
}


/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
